AccumulationRegisters/ЗадолженностьПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектам</Name>
			<Comment>Трейд Софт Задолженность по долговому обязательству</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Comment>Дополнительная аналитика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗадолженностьПоОбъектамОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектамОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗадолженностьПоОбъектам/Ext/RecordSetModule.bsl
Процедура ПриЗаписиСтарая(Отказ, Замещение)
	ОбъектыОтбора = ОбъектыСервер.ОтборОбъектовПоРегистратору(ЭтотОбъект);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗадолженностьПоОбъектамОстаткиРС.Объект КАК ОбъектРС,
	                      |	ЗадолженностьПоОбъектамОстатки.Объект КАК Объект,
	                      |	ЗадолженностьПоОбъектамОстатки.СуммаДООстаток КАК СуммаДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаРеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток КАК ПроцентыРеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток КАК ШтрафыРеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.ПроцентыДООстаток КАК ПроцентыДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.ШтрафыДООстаток КАК ШтрафыДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.ПениДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая1ДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая2ДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая3ДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая4ДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая5ДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая6ДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая7ДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая8ДООстаток,
	                      |	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(, Объект В (&МассивОбъектов)) КАК ЗадолженностьПоОбъектамОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадолженностьПоОбъектамОстатки КАК ЗадолженностьПоОбъектамОстаткиРС
	                      |		ПО ЗадолженностьПоОбъектамОстатки.Объект = ЗадолженностьПоОбъектамОстаткиРС.Объект
	                      |			И (ЗадолженностьПоОбъектамОстаткиРС.ТипЗадолженности = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыЗадолженности.Сумма))
	                      |ГДЕ
	                      |	ЕСТЬNULL(ЗадолженностьПоОбъектамОстаткиРС.ТипЗадолженности, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыЗадолженности.Сумма)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыЗадолженности.Сумма)
	                      |	И (ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток, 0) <> ЕСТЬNULL(ЗадолженностьПоОбъектамОстаткиРС.СуммаРегл, 0)
	                      |			ИЛИ ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаДООстаток, 0) <> ЕСТЬNULL(ЗадолженностьПоОбъектамОстаткиРС.СуммаДО, 0))"); 
	Запрос.УстановитьПараметр("МассивОбъектов",ОбъектыОтбора);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Набор = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(?(Результат.ОбъектРС <> Null, Результат.ОбъектРС, Результат.Объект));
		
		Если ЗначениеЗаполнено(Результат.Объект) Тогда
			
			МассивНазванияСоставляющих = ПолучитьМассивНазванияСоставляющих();
			МассивЧастейРегистров = ПолучитьМассивЧастейРегистров();
			СуфиксПараметраЗапроса = ПолучитьСуфиксПараметраЗапроса();
			
			Для каждого НазваниеСоставляющей Из МассивНазванияСоставляющих Цикл
			
				СоставляющаяДООстаток = НазваниеСоставляющей + МассивЧастейРегистров[0] + СуфиксПараметраЗапроса;
				СоставляющаяРеглОстаток = НазваниеСоставляющей + МассивЧастейРегистров[1] + СуфиксПараметраЗапроса;
				Если Результат[СоставляющаяДООстаток] <> 0 И Результат[СоставляющаяРеглОстаток] <> 0 Тогда
					Нов = Набор.Добавить();
					Нов.Объект = Результат.Объект;
					Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности[НазваниеСоставляющей];
					Нов.СуммаДО   = Результат[СоставляющаяДООстаток];
					Нов.СуммаРегл = Результат[СоставляющаяРеглОстаток];
				КонецЕсли;
			
			КонецЦикла;
			
		//	Если Результат.СуммаДООстаток <> 0 И Результат.СуммаРеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Сумма;
		//		Нов.СуммаДО   = Результат.СуммаДООстаток;
		//		Нов.СуммаРегл = Результат.СуммаРеглОстаток;
		//	КонецЕсли;	
		//	
		//	Если Результат.ОсновнойДолгДООстаток <> 0 И Результат.ОсновнойДолгРеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.ОсновнойДолг;
		//		Нов.СуммаДО   = Результат.ОсновнойДолгДООстаток;
		//		Нов.СуммаРегл = Результат.ОсновнойДолгРеглОстаток;
		//	КонецЕсли;
		//	
		//	Если Результат.ПроцентыДООстаток <> 0 И Результат.ПроцентыРеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Проценты;
		//		Нов.СуммаДО   = Результат.ПроцентыДООстаток;
		//		Нов.СуммаРегл = Результат.ПроцентыРеглОстаток;
		//	КонецЕсли;
		//	
		//	Если Результат.ШтрафыДООстаток <> 0 И Результат.ШтрафыРеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Штрафы;
		//		Нов.СуммаДО   = Результат.ШтрафыДООстаток;
		//		Нов.СуммаРегл = Результат.ШтрафыРеглОстаток;
		//	КонецЕсли;
		//	
		//	Если Результат.ПениДООстаток <> 0 И Результат.ПениРеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Пени;
		//		Нов.СуммаДО   = Результат.ПениДООстаток;
		//		Нов.СуммаРегл = Результат.ПениРеглОстаток;
		//	КонецЕсли;
		//	
		//	Если Результат.Составляющая1ДООстаток <> 0 И Результат.Составляющая1РеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая1;
		//		Нов.СуммаДО   = Результат.Составляющая1ДООстаток;
		//		Нов.СуммаРегл = Результат.составляющая1РеглОстаток;
		//	КонецЕсли;

		//	Если Результат.Составляющая2ДООстаток <> 0 И Результат.Составляющая2РеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая2;
		//		Нов.СуммаДО   = Результат.Составляющая2ДООстаток;
		//		Нов.СуммаРегл = Результат.составляющая2РеглОстаток;
		//	КонецЕсли;
		//	
		//	Если Результат.Составляющая3ДООстаток <> 0 И Результат.Составляющая3РеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая3;
		//		Нов.СуммаДО   = Результат.Составляющая3ДООстаток;
		//		Нов.СуммаРегл = Результат.составляющая3РеглОстаток;
		//	КонецЕсли;			
		//	
		//	Если Результат.Составляющая4ДООстаток <> 0 И Результат.Составляющая4РеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая4;
		//		Нов.СуммаДО   = Результат.Составляющая4ДООстаток;
		//		Нов.СуммаРегл = Результат.составляющая4РеглОстаток;
		//	КонецЕсли;			
		//	
		//	Если Результат.Составляющая5ДООстаток <> 0 И Результат.Составляющая5РеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая5;
		//		Нов.СуммаДО   = Результат.Составляющая5ДООстаток;
		//		Нов.СуммаРегл = Результат.составляющая5РеглОстаток;
		//	КонецЕсли;			
		//	
		//	Если Результат.Составляющая6ДООстаток <> 0 И Результат.Составляющая6РеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая6;
		//		Нов.СуммаДО   = Результат.Составляющая6ДООстаток;
		//		Нов.СуммаРегл = Результат.составляющая6РеглОстаток;
		//	КонецЕсли;			
		//	
		//	Если Результат.Составляющая7ДООстаток <> 0 И Результат.Составляющая7РеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая7;
		//		Нов.СуммаДО   = Результат.Составляющая7ДООстаток;
		//		Нов.СуммаРегл = Результат.составляющая7РеглОстаток;
		//	КонецЕсли;			
		//	
		//	Если Результат.Составляющая8ДООстаток <> 0 И Результат.Составляющая8РеглОстаток <> 0 Тогда
		//		Нов = Набор.Добавить();
		//		Нов.Объект = Результат.Объект;
		//		Нов.ТипЗадолженности = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая8;
		//		Нов.СуммаДО   = Результат.Составляющая8ДООстаток;
		//		Нов.СуммаРегл = Результат.составляющая8РеглОстаток;
		//	КонецЕсли;						
		КонецЕсли;	
				
		Попытка
			Набор.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьМассивНазванияСоставляющих()

	МассивНазванияСоставляющих = Новый Массив;
	
	МассивНазванияСоставляющих.Добавить("Сумма");
	МассивНазванияСоставляющих.Добавить("ОсновнойДолг");
	МассивНазванияСоставляющих.Добавить("Проценты");
	МассивНазванияСоставляющих.Добавить("Штрафы");
	МассивНазванияСоставляющих.Добавить("Пени");
	МассивНазванияСоставляющих.Добавить("Составляющая1");
	МассивНазванияСоставляющих.Добавить("Составляющая2");
	МассивНазванияСоставляющих.Добавить("Составляющая3");
	МассивНазванияСоставляющих.Добавить("Составляющая4");
	МассивНазванияСоставляющих.Добавить("Составляющая5");
	МассивНазванияСоставляющих.Добавить("Составляющая6");
	МассивНазванияСоставляющих.Добавить("Составляющая7");
	МассивНазванияСоставляющих.Добавить("Составляющая8");
	
	Возврат МассивНазванияСоставляющих;

КонецФункции // ()

Функция ПолучитьСуфиксПараметраЗапроса()

	Возврат "Остаток";

КонецФункции

Функция ПолучитьМассивЧастейРегистров()

	МассивЧастейРегистров = Новый Массив;
	
	МассивЧастейРегистров.Добавить("ДО");
	МассивЧастейРегистров.Добавить("Регл");
	
	Возврат МассивЧастейРегистров;

КонецФункции

Процедура ПриЗаписи(Отказ, Замещение)
	//3.7.4.18: обновление регистра РС Задолженность по Объектам остатки переехало в процедуру
	//ОбъектыСервер.ЗаписатьТекущиеПараметрыЗадолженностиОбработчик
КонецПроцедуры
